SiliconLabs/platform_applications/platform_adc_enob/src/efr32bg22_adc.c
/**************************************************************************//**
 * @file efr32bg22_adc.c
 * @brief EFR32BG22 adc routine for calibration and read.
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************
 * # Evaluation Quality
 * This code has been minimally tested to ensure that it builds and is suitable
 * as a demonstration for evaluation purposes only. This code will be 
 * maintained at the sole discretion of Silicon Labs.
 *****************************************************************************/
#include "math.h"
#include "em_cmu.h"
#include "em_emu.h"
#include "em_iadc.h"
#include "em_msc.h"
#include "em_letimer.h"
#include "efr32bg22_adc.h"
#include "dac70501_dac.h"
#include "ads1220_adc.h"

// button
#define EM4WU_PORT                  gpioPortC
#define EM4WU_PIN                   5
#define EM4WU_EM4WUEN_NUM           (7)
#define EM4WU_EM4WUEN_MASK          (1 << EM4WU_EM4WUEN_NUM)

// led
#define LED_PORT                    gpioPortC
#define LED_PIN                     3

// msc
#define USERDATA                    ((uint32_t*)USERDATA_BASE)
#define POSITION                    3

/******************************************************************************
 *******************************   DEFINES   **********************************
 *****************************************************************************/
// Set CLK_ADC to 10MHz 
// (this corresponds to a sample rate of 77K with OSR = 32)
// CLK_SRC_ADC; largest division is by 4
#define CLK_SRC_ADC_FREQ            20000000
// CLK_ADC; IADC_SCHEDx PRESCALE has 10 valid bits
#define CLK_ADC_FREQ                10000000

// adc input channel/pins
#define ADC_POS_INPUT               iadcPosInputPortCPin0
#define ADC_NEG_INPUT               iadcNegInputPortCPin1
// When changing GPIO port/pins above, make sure to change xBUSALLOC macro's
// accordingly.
#define IADC_INPUT_0_BUS            CDBUSALLOC
#define IADC_INPUT_0_BUSALLOC       GPIO_CDBUSALLOC_CDEVEN0_ADC0
#define IADC_INPUT_1_BUS            CDBUSALLOC
#define IADC_INPUT_1_BUSALLOC       GPIO_CDBUSALLOC_CDODD0_ADC0

// for calibration
// How many samples to capture and average
#define NUM_SAMPLES                 1024
#define IADC_SCALE_OFFSET_MAX_NEG   0x00020000UL // 18-bit 2's compliment
#define IADC_SCALE_OFFSET_ZERO      0x00000000UL

/******************************************************************************
 ***************************   GLOBAL VARIABLES   *****************************
 *****************************************************************************/
// Stores latest ADC sample and converts to volts
static volatile IADC_Result_t sample;
static volatile double single_result;

// buffer to save adc result
double buffer[1024];
volatile uint32_t loop = 0;
double adc_gain_result;
double adc_offset_result;

uint32_t cleared_value, write_value;
volatile uint8_t button_em_mode = 0;

/**************************************************************************//**
 * @brief GPIO Interrupt handler for even pins.
 * @comment
 *    em2 support
 *****************************************************************************/
void GPIO_ODD_IRQHandler(void)
{
  // Get and clear all pending GPIO interrupts
  uint32_t isr_mask = GPIO_IntGet();
  GPIO_IntClear(isr_mask);

  // Check if button 1 was pressed
  if (isr_mask & ((1 << EM4WU_PIN) | GPIO_IEN_EM4WUIEN7)) {
    // add your code here
    // this toggle the LED
    GPIO_PinOutToggle(LED_PORT, LED_PIN);
  }
}

/**************************************************************************//**
 * @brief
 *    init letimer
 * @param[in]
 *    none
 * @return
 *    none
 * @comment
 *    24-bit down count for delay
 *****************************************************************************/
void init_letimer(void)
{
  LETIMER_Init_TypeDef letimer_init = LETIMER_INIT_DEFAULT;

  // use LFRCO
  CMU_ClockSelectSet(cmuClock_EM23GRPACLK, cmuSelect_LFRCO);
  // Enable clock for letimer
  CMU_ClockEnable(cmuClock_LETIMER0, true);

  // field initialize
  letimer_init.enable = false;
  letimer_init.debugRun = true;

  // Initialize LETIMER
  LETIMER_Init(LETIMER0, &letimer_init);
  LETIMER_CounterSet(LETIMER0, 10);
}

/**************************************************************************//**
 * @brief
 *    Delay with letimer
 * @param[in]
 *    usec, with 32.768 clock frequency
 *    unit = 1/32.768 = 30.57 uS
 * @return
 *    none
 * @comment
 *    for delay， em0 only
 *****************************************************************************/
void letimer_delay(uint32_t msec)
{
  // enable and wait CNT equal
  uint32_t total_ticks = 0xFFFFFF - msec * 32.768;
  LETIMER_Enable(LETIMER0, true);
  while (LETIMER_CounterGet(LETIMER0) >= total_ticks) {}

  // reset CNT and disable
  LETIMER_CounterSet(LETIMER0, 0);
  LETIMER_Enable(LETIMER0, false);
}

/**************************************************************************//**
 * @brief
 *    EMU temperature read back
 * @param[in]
 *    none
 * @return
 *    bg22 die temperature in Celcius unit
 *****************************************************************************/
float get_die_temperature(void)
{
  uint32_t di_temp = 0, di_emu = 0;
  float emu_tempC = 0.0, temp_degC = 0.0, offset_correction = 0.0;

  // Read EMU temperature sensor calibration data from device info page
  di_temp = (DEVINFO->CALTEMP & _DEVINFO_CALTEMP_TEMP_MASK)
            >> _DEVINFO_CALTEMP_TEMP_SHIFT;
  di_emu = (DEVINFO->EMUTEMP & _DEVINFO_EMUTEMP_EMUTEMPROOM_MASK)
           >> _DEVINFO_EMUTEMP_EMUTEMPROOM_SHIFT;

  // EMU temperature raw data in Celcius unit
  emu_tempC = EMU_TemperatureGet();

  // compensate the data
  offset_correction = di_emu - 273.15 - di_temp;
  temp_degC = emu_tempC - offset_correction;

