SiliconLabs/platform_applications/platform_adc_enob/src/efr32bg22_adc.c
  return temp_degC;
}

/**************************************************************************//**
 * @brief
 *    turn on led
 * @param[in]
 *    onoff: 1-on, 0-off
 * @return
 *    none
 *****************************************************************************/
void light_led(uint8_t onoff)
{
  // Enable clock
  CMU_ClockEnable(cmuClock_GPIO, true);

  // Set chosen port pin as output
  GPIO_PinModeSet(LED_PORT, LED_PIN, gpioModePushPull, onoff);
}

/**************************************************************************//**
 * @brief
 *    gpio (button) init for em0/1
 * @param[in]
 *    none
 * @return
 *    none
 *****************************************************************************/
void init_button_em1(void)
{
  // Enable clock
  CMU_ClockEnable(cmuClock_GPIO, true);

  // Configure Button PC5 as input and enable interrupt
  // internal pull-up
  GPIO_PinModeSet(EM4WU_PORT, EM4WU_PIN, gpioModeInputPullFilter, 1);

  // falling edge interrupt
  GPIO_ExtIntConfig(EM4WU_PORT,
                    EM4WU_PIN,
                    EM4WU_PIN,
                    false,
                    true,
                    true);

  // Enable ODD interrupt to catch button press 
  NVIC_ClearPendingIRQ(GPIO_ODD_IRQn);
  NVIC_EnableIRQ(GPIO_ODD_IRQn);

  // enter EM1
  button_em_mode = 1;
}

/**************************************************************************//**
 * @brief
 *    gpio (button) init for em2
 * @param[in]
 *    none
 * @return
 *    none
 *****************************************************************************/
void init_button_em2(void)
{
  // Enable clock
  CMU_ClockEnable(cmuClock_GPIO, true);

  // Configure Button PC5 as input and enable interrupt
  GPIO_PinModeSet(EM4WU_PORT, EM4WU_PIN, gpioModeInputPullFilter, 1);

  // falling edge interrupt
  GPIO_EM4EnablePinWakeup(GPIO_IEN_EM4WUIEN7, 0 << _GPIO_IEN_EM4WUIEN7_SHIFT);
  GPIO->IEN = 1 << _GPIO_IEN_EM4WUIEN7_SHIFT;
  GPIO->EM4WUEN = 1 << _GPIO_IEN_EM4WUIEN7_SHIFT;

  // Enable EVEN interrupt to catch button press
  NVIC_ClearPendingIRQ(GPIO_EVEN_IRQn);
  NVIC_EnableIRQ(GPIO_EVEN_IRQn);

  // Enable ODD interrupt to catch button press
  NVIC_ClearPendingIRQ(GPIO_ODD_IRQn);
  NVIC_EnableIRQ(GPIO_ODD_IRQn);

  // enter EM2
  button_em_mode = 2;
}

/**************************************************************************//**
 * @brief
 *    gpio (button) init for em4
 * @param[in]
 *    none
 * @return
 *    none
 *****************************************************************************/
void init_button_em4(void)
{
  // Use default settings for EM4
  EMU_EM4Init_TypeDef em4_Init = EMU_EM4INIT_DEFAULT;

  // Enable clock
  CMU_ClockEnable(cmuClock_GPIO, true);

  // Configure Button PC5 as input and EM4 wake-up source
  // internal pull high
  GPIO_PinModeSet(EM4WU_PORT, EM4WU_PIN, gpioModeInputPullFilter, 1);

  // Enable GPIO pin wake-up from EM4; PC5 is EM4WUEN pin 7
  GPIO_EM4EnablePinWakeup(GPIO_IEN_EM4WUIEN7, 0 << _GPIO_IEN_EM4WUIEN7_SHIFT);

  // Enable Pin Retention through EM4 and wakeup
  em4_Init.pinRetentionMode = emuPinRetentionLatch;
  // Initialize EM mode 4
  EMU_EM4Init(&em4_Init);

  button_em_mode = 4;
}

/**************************************************************************//**
 * @brief
 *    adc result rms calculation
 * @param[in]
 *    buffer, adc result
 *    adcAve, average
 * @return
 *    none
 *****************************************************************************/
double rms_cal(double buffer[], double adcAve)
{
  double adc_acc = 0.0, adc_rms_value;

  for (uint32_t i = 0; i < ADC_BUFFER_SIZE; i++) {
    adc_acc += (buffer[i] - adcAve) * (buffer[i] - adcAve);
  }

  adc_rms_value = sqrt(adc_acc) / 1023.0 * 1000;   // in mV
  return adc_rms_value;
}

/**************************************************************************//**
 * @brief  ADC Handler, never be used/called
 * This code don't use interrupt, instead it use polling mode
 *****************************************************************************/
void IADC_IRQHandler(void)
{
  // Read data from the FIFO, 16-bit result
  sample = IADC_pullSingleFifoResult(IADC0);

  // For differential the result range is -Vref to +Vref, i.e., 16 bits for the
  // conversion value.
  single_result = sample.data * 1.25 * 2 / 0xFFFF;

  // clear int flag
  IADC_clearInt(IADC0, IADC_IF_SINGLEFIFODVL);

  // store result to buffer
  if (loop < NUM_SAMPLES) {
    buffer[loop] = single_result;
    loop++;
    letimer_delay(2);
  }
}

/**************************************************************************//**
 * @brief re-scale register SCALE
 *    note: IADC must be disabled to change scale
 * @param[in]
 *    scale value in CFG[0]
 * @return
 *    none
 *****************************************************************************/
void rescale_iadc(uint32_t newScale)
{
  // Disable the IADC
  IADC0->EN_CLR = IADC_EN_EN;

  // configure new scale settings
  IADC0->CFG[0].SCALE = newScale;

  // Re-enable IADC
  IADC0->EN_SET = IADC_EN_EN;
}

/**************************************************************************//**
 * @brief reset iadc
 *    note: to save power
* @param[in]
 *    none
 * @return
 *    none
 *****************************************************************************/
void reset_iadc(void)
{
  IADC_reset(IADC0);
}

/**************************************************************************//**
 * @brief
 *    poll signle adc result
 * @param[in]
 *    none
 * @return
 *    iadc value in volt unit
 *****************************************************************************/
double iadc_poll_single_result(void)
{
  // start converting
  IADC_command(IADC0, iadcCmdStartSingle);

  // Wait for conversion to be complete
  // while combined status bits 8 & 6 don't equal 1 and 0 respectively
  while ((IADC0->STATUS 
        & (_IADC_STATUS_CONVERTING_MASK | _IADC_STATUS_SINGLEFIFODV_MASK))
        != IADC_STATUS_SINGLEFIFODV) {}

  // Read data from the FIFO, 16-bit result
  sample = IADC_pullSingleFifoResult(IADC0);

  // For differential the result range is -Vref to +Vref, i.e., 16 bits for the
  // conversion value.
  single_result = sample.data * 1.25 * 2 / 0xFFFF;

  return single_result;
}

/**************************************************************************//**
 * @brief  Take several sequential samples and average the measurement
 * @param[in]
 *    numSamples - number of adc samples
 * @return
 *    adc average raw data
 *****************************************************************************/
double iadc_average_conversion(uint32_t numSamples)
{
  uint32_t i;
  double average;
  IADC_Result_t sample;

  // Averaging loop, reset accumulator
  average = 0;
  for (i = 0; i < numSamples; i++) {
    // Start IADC conversion
    IADC_command(IADC0, iadcCmdStartSingle);

    // Wait for conversion to be complete
    // while combined status bits 8 & 6 don't equal 1 and 0 respectively

    while ((IADC0->STATUS 
          & (_IADC_STATUS_CONVERTING_MASK | _IADC_STATUS_SINGLEFIFODV_MASK))
          != IADC_STATUS_SINGLEFIFODV) {}

    // Get ADC result and accumulate
    sample = IADC_pullSingleFifoResult(IADC0);
    average += (int32_t)sample.data;
  }
  // get average
  average /= NUM_SAMPLES;

  return average;
}

/**************************************************************************//**
 * @brief
 *    IADC Initializer SCAN+LDMA
 * @param[in]
 *    none
 * @return
 *    none
 *****************************************************************************/
void init_iadc_scan(void)
{
  // dummy, may use LDMA
}

/**************************************************************************//**
 * @brief
 *    IADC Initializer
 * @param[in]
 *    none
 * @return
 *    none
 *****************************************************************************/
void init_iadc(void)
{
  // Declare init structs
  IADC_Init_t init = IADC_INIT_DEFAULT;
  IADC_AllConfigs_t init_all_configs = IADC_ALLCONFIGS_DEFAULT;
  IADC_InitSingle_t init_single = IADC_INITSINGLE_DEFAULT;
  IADC_SingleInput_t init_single_input = IADC_SINGLEINPUT_DEFAULT;

