SiliconLabs/platform_applications/platform_adc_enob/src/efr32bg22_adc.c
  // Configure IADC clock source
  CMU_ClockSelectSet(cmuClock_IADCCLK, cmuSelect_FSRCO);
  // Enable IADC clock
  CMU_ClockEnable(cmuClock_IADC0, true);

  // Reset IADC to reset configuration in case it has been modified
  IADC_reset(IADC0);

  // Modify init structs and initialize
  init.warmup = iadcWarmupKeepWarm;
  // Set the HFSCLK prescale value here
  // CLK_SRC_ADC = CLK_SRC_ADC_FREQ, CLK_CMU_ADC = 0
  init.srcClkPrescale = IADC_calcSrcClkPrescale(IADC0, CLK_SRC_ADC_FREQ, 0);

  // Configuration 0 is used by both scan and single conversions by default
  // Use external reference as reference
  init_all_configs.configs[0].reference = iadcCfgReferenceExt1V25;
  // Divides CLK_SRC_ADC to set the CLK_ADC frequency for desired sample rate
  init_all_configs.configs[0].adcClkPrescale =
                            IADC_calcAdcClkPrescale(IADC0,
                            CLK_ADC_FREQ,
                            0,
                            iadcCfgModeNormal,
                            init.srcClkPrescale);

  // Set over sampling rate to 32x
  // resolution formula res = 11 + log2(oversampling * digital averaging)
  // in this case res = 11 + log2(32 * 1) = 16

  init_all_configs.configs[0].osrHighSpeed = iadcCfgOsrHighSpeed32x;

  // Single initialization
  init_single.dataValidLevel = _IADC_SINGLEFIFOCFG_DVL_VALID1;
  // Set conversions to run once per trigger
  init_single.triggerAction = iadcTriggerActionOnce;
  // Set alignment to right justified with 16 bits for data field
  init_single.alignment = iadcAlignRight16;

  // Configure input sources for differential conversion
  init_single_input.posInput = ADC_POS_INPUT;
  init_single_input.negInput = ADC_NEG_INPUT;

  // Initialize IADC
  // This is taken care of in the IADC_init() function in the emlib em_iadc

  IADC_init(IADC0, &init, &init_all_configs);

  // Initialize single
  IADC_initSingle(IADC0, &init_single, &init_single_input);

  // Allocate the analog bus for ADC0 inputs
  GPIO->IADC_INPUT_0_BUS |= IADC_INPUT_0_BUSALLOC;
  GPIO->IADC_INPUT_1_BUS |= IADC_INPUT_1_BUSALLOC;
}

/**************************************************************************//**
 * @brief  Initialize IADC function
 * @param[in]
 *    none
 * @return
 *    none
 *****************************************************************************/
void init_iadc_for_cali(void)
{
  // Declare init structs
  IADC_Init_t init = IADC_INIT_DEFAULT;
  IADC_AllConfigs_t init_all_configs = IADC_ALLCONFIGS_DEFAULT;
  IADC_InitSingle_t init_single = IADC_INITSINGLE_DEFAULT;
  IADC_SingleInput_t init_single_input = IADC_SINGLEINPUT_DEFAULT;

  // Enable IADC0 clock branch
  CMU_ClockEnable(cmuClock_IADC0, true);
  // Select clock for IADC
  CMU_ClockSelectSet(cmuClock_IADCCLK, cmuSelect_FSRCO);   // FSRCO - 20MHz 

  // Set warmup mode
  init.warmup = iadcWarmupKeepWarm;
  // Set the HFSCLK pre-scale value here
  init.srcClkPrescale = IADC_calcSrcClkPrescale(IADC0, CLK_SRC_ADC_FREQ, 0);

  // Configuration 0 is used by both scan and single conversions by default
  // Use external reference
  init_all_configs.configs[0].reference = iadcCfgReferenceExt1V25;
  // Force IADC to use bipolar inputs for conversion
  init_all_configs.configs[0].twosComplement = iadcCfgTwosCompBipolar;
  // Divides CLK_SRC_ADC to set the CLK_ADC frequency
  init_all_configs.configs[0].adcClkPrescale = 
    IADC_calcAdcClkPrescale(IADC0,
    CLK_ADC_FREQ,
    0,
    iadcCfgModeNormal,
    init.srcClkPrescale);

  // 32x OVS mode
  init_all_configs.configs[0].osrHighSpeed = iadcCfgOsrHighSpeed32x;

  // single initialization
  init_single.alignment = iadcAlignRight16;

  // Assign pins to positive and negative inputs in differential mode
  init_single_input.posInput = iadcPosInputPortCPin0; // PC00
  init_single_input.negInput = iadcNegInputPortCPin1; // PC01

  // Initialize the IADC
  IADC_init(IADC0, &init, &init_all_configs);
  // Initialize the Single conversion inputs
  IADC_initSingle(IADC0, &init_single, &init_single_input);

  // Allocate the analog bus for ADC0 inputs
  GPIO->IADC_INPUT_0_BUS |= IADC_INPUT_0_BUSALLOC;
  GPIO->IADC_INPUT_1_BUS |= IADC_INPUT_1_BUSALLOC;
}

/**************************************************************************//**
 * @brief
 *    Use DAC dac70501 to calibrate the bg22 iadc gain and offset
 * @param[in]
 *    none
 * @return
 *    calbrated scale value
 *****************************************************************************/
uint32_t iadc_differential_calibrate(void)
{
  // please pay attention that offset is dependent to analog gain and OSR
  uint32_t scale;                           // offset is dependent to scale
  uint32_t cali_gain1_msb;                  // msb gain result
  double cali_gain13_lsb;                   // 0.75 or 1.0 gain

  double result_fullscale,                  // full scale result, 1250mV
         result_zero,                       // zero result, 0v
         result_offset,                     // zero offset, 0v
         result_range;                      // resultFullscale - resultZero
  double gain_correction_factor;            // gain correction factor
  int32_t iadc_calculated_offset;           // offset from resultZero
  // gain resolution, 0.25 / 8192 = 0.000030517578125
  double IADC_GAIN13LSB_LSB = 0.25 / 8192;  // lsb gain multiply factor

  uint32_t iadc_calibrated_gain3_lsb;       // gain result value
  int32_t iadc_calibrated_offset;           // offset result value

  // Initialize ADC for calibration
  init_iadc_for_cali();
  iadc_calibrated_gain3_lsb = (IADC0->CFG[0].SCALE & _IADC_SCALE_GAIN13LSB_MASK)
                              >> _IADC_SCALE_GAIN13LSB_SHIFT;   // 13 bit 
  iadc_calibrated_offset = (IADC0->CFG[0].SCALE & _IADC_SCALE_OFFSET_MASK)
                           >> _IADC_SCALE_OFFSET_SHIFT;         // 18 bit 

  // range, 0.75x to 1.2499x
  // bitfield GAIN3MSB (3 MSBs of the 16-bit gain value)
  // value   0(011)   1(100)
  // gain    0.75x    1.0x
  // bitfield GAIN13LSB (13 LSBs of the 16-bit gain value)
  // value   0x0000          0x1FFF
  // gain    0.75/1.0000     1.00/1.2499


  // Set initial offset to maximum negative and initial gain to 1.0

