SiliconLabs/platform_applications/platform_adc_enob/src/efr32bg22_adc.c
  scale = IADC_SCALE_GAIN3MSB_GAIN100 | IADC_SCALE_GAIN13LSB_DEFAULT
          | IADC_SCALE_OFFSET_MAX_NEG;
  // here we use config[0] only
  rescale_iadc(scale);

  // Apply a full-scale (almost) positive input to the IADC
  // Wait until differential voltage is applied
  // Take multiple conversions and average to reduce system-level noise
  // This is the ADC raw data.
  dac70501_set_volt(1.25);
  result_fullscale = iadc_average_conversion(NUM_SAMPLES);

  // Apply a zero differential input to the IADC (short POS and NEG)
  // Wait until differential voltage is applied
  // Take multiple conversions and average to reduce system-level noise
  dac70501_set_volt(0.0);
  result_zero = iadc_average_conversion(NUM_SAMPLES);

  // Calculate gain correction factor
  // In bipolar mode, expected positive full-scale for IADC is
  // (2^15) - 1 = 32727
  result_range = result_fullscale - result_zero;

  // gainCorrectionFactor equals
  // 32767 / (resultFullscale - resultZero)
  gain_correction_factor = (double)32767.0 / result_range;
  adc_gain_result = gain_correction_factor;

  // calculate the coarse offset here
  iadc_calculated_offset = -(IADC_SCALE_OFFSET_MAX_NEG + result_zero * 16);
  iadc_calculated_offset = iadc_calculated_offset * gain_correction_factor;

  // Correct gain:
  // Set IADC correction gain and clear offset in order to calibrate offset
  // 3 MSB of gain is represented by 1 bit;
  //     a. 1 => 100 representing 1.00x to 1.2499x,
  //     b. 0 => 011 representing 0.75x to 0.9999x
  if (gain_correction_factor >= 1.0) {
    // need to increase gain
    cali_gain1_msb = IADC_SCALE_GAIN3MSB_GAIN100;
    cali_gain13_lsb = (gain_correction_factor - 1.0) / IADC_GAIN13LSB_LSB;
    // round to the nearest integer
    iadc_calibrated_gain3_lsb = (uint32_t)(cali_gain13_lsb + 0.5);
    scale = IADC_SCALE_GAIN3MSB_GAIN100                                  // 3 msb  
            | (iadc_calibrated_gain3_lsb << _IADC_SCALE_GAIN13LSB_SHIFT) // 13 lsb
            | IADC_SCALE_OFFSET_ZERO;                                    // offset 
  } else {
    // need to decrease gain
    cali_gain1_msb = IADC_SCALE_GAIN3MSB_GAIN011;
    cali_gain13_lsb = (gain_correction_factor - 0.75) / IADC_GAIN13LSB_LSB;
    // round to the nearest integer
    iadc_calibrated_gain3_lsb = (uint32_t)(cali_gain13_lsb + 0.5);
    scale = IADC_SCALE_GAIN3MSB_GAIN011
            | (iadc_calibrated_gain3_lsb << _IADC_SCALE_GAIN13LSB_SHIFT)
            | IADC_SCALE_OFFSET_ZERO;
  }

  // apply the gain correction 
  rescale_iadc(scale);

  // Correct offset:
  // Apply a zero differential input to the IADC (short POS and NEG)
  // Take multiple conversions and average to reduce system-level noise

  // already applied zero when measure resultZero
  result_offset = iadc_average_conversion(NUM_SAMPLES);
  adc_offset_result = result_offset * 1.25 * 2 / 0xFFFF * 1000;         // in mV

  // scale and negate offset
  // OFFSET is encoded as a 2's complement,
  // 18-bit number with the LSB representing 1 / (2^20) of full scale.

  // 16-bit convert to 20-bit, need gain 2^(20-16) = 16
  iadc_calibrated_offset = (int32_t)(result_offset * -16);

  // 18-bit boundary check [-2^17 <-> (2^17-1)]
  // Check if offset is too large to be corrected and
  // set to maximum correction allowed
  if (iadc_calibrated_offset > 131071) {
    iadc_calibrated_offset = 131071;
  }
  if (iadc_calibrated_offset < -131072) {
    iadc_calibrated_offset = -131072;
  }

  // offset and gain result
  scale = cali_gain1_msb
          | (iadc_calibrated_gain3_lsb << _IADC_SCALE_GAIN13LSB_SHIFT)
          | (iadc_calibrated_offset & _IADC_SCALE_OFFSET_MASK);

  // apply gain and offset correction
  rescale_iadc(scale);

  // expected to get result close to zero
  // for test purpose
  result_offset = iadc_average_conversion(NUM_SAMPLES);

  // set dac70501 voltage for test
  gain_correction_factor = 0.60f;
  dac70501_set_volt((float)gain_correction_factor);
  letimer_delay(2);

  // test result, 10 samples
  for (uint8_t i = 0; i < 20; i++) {
    // store result to buffer
    buffer[i] = iadc_poll_single_result();
  }

  IADC_reset(IADC0);

  return scale;
}

/***************************************************************************//**
 * @brief
 *    save iadc calibration data to internal flash
 * @param[in]
 *    scale, config scale value
 * @return
 *    none
 ******************************************************************************/
void bg22_save_cal_data(uint32_t scale)
{
  // Enable MSC Clock
  CMU_ClockEnable(cmuClock_MSC, true);

  // Clear the user data page of any previous data stored
  MSC_ErasePage(USERDATA);

  // Read the initial value in the cleared page
  cleared_value = USERDATA[POSITION + POSITION];

  // Write the value into the 4th word of the user data portion of the flash
  MSC_Init();
  MSC_WriteWord((USERDATA + POSITION), &scale, 4);
  MSC_Deinit();

  write_value = USERDATA[POSITION + POSITION];
}

/***************************************************************************//**
 * @brief
 *    restore iadc calibration data from flash into register
 * @param[in]
 *    none
 * @return
 *    none
 ******************************************************************************/
void bg22_restore_cal_data(void)
{
  uint32_t scale;

  scale = USERDATA[POSITION];
  rescale_iadc(scale);
}
